org/notes/20240219094625-on_imposter_syndrome.org
:PROPERTIES:
:ID:       FC9B6DAB-0BB0-44D7-AC47-325E65D3F332
:END:
#+title: On Imposter Syndrome

- tags :: [[id:DCDF7171-E206-46AD-9A70-BDB9760E347D][Growth and Habits]] 

* NOTE On Imposter Syndrome :notes: 
One of the psychologists who coined the term “impostor syndrome,” Pauline Rose Clance, has said that she regrets the
“syndrome” part of that phrase. “If I could do it all over again,”
she told an interviewer in 2015, “I would call it the impostor experience, because it’s not a syndrome or a complex or a mental illness.
It’s something almost everyone [goes through at some point].” 
Added: [2024-02-12 Mon 16:39]


