content/garden/20240219094625-on_imposter_syndrome.md
+++
title = "On Imposter Syndrome"
author = ["Darrell Banks"]
draft = true
+++

tags
: [Growth and Habits]({{< relref "20231031114232-growth_and_habits.md" >}})


## NOTE On Imposter Syndrome <span class="tag"><span class="notes">notes</span></span> {#note-on-imposter-syndrome}

One of the psychologists who coined the term “impostor syndrome,” Pauline Rose Clance, has said that she regrets the
“syndrome” part of that phrase. “If I could do it all over again,”
she told an interviewer in 2015, “I would call it the impostor experience, because it’s not a syndrome or a complex or a mental illness.
It’s something almost everyone [goes through at some point].”
Added: <span class="timestamp-wrapper"><span class="timestamp">[2024-02-12 Mon 16:39]</span></span>
